 /*********************************************************************/
 /* DCLGEN TABLE(PROD.PURTDELI)                                       */
 /*        LIBRARY(COMMON.TMEM.DEV.DCLLIB(PURTDELI))                  */
 /*        ACTION(REPLACE)                                            */
 /*        LANGUAGE(PLI)                                              */
 /*        STRUCTURE(PURTDELI)                                        */
 /*        APOST                                                      */
 /* ... IS THE DCLGEN COMMAND THAT MADE THE FOLLOWING STATEMENTS      */
 /*********************************************************************/
 EXEC SQL DECLARE PURTDELI TABLE
           ( MANIFEST                       CHAR(12) NOT NULL,
             PART_NUM                       CHAR(12) NOT NULL,
             SUPL_CD                        CHAR(4) NOT NULL,
             PLNT_CD                        CHAR(1) NOT NULL,
             DOCK                           CHAR(2) NOT NULL,
             PUR_ITEM                       CHAR(1) NOT NULL,
             PART_CAT                       CHAR(1) NOT NULL,
             RCVD_DATE                      CHAR(8) NOT NULL,
             INVOICE_NUM                    CHAR(10) NOT NULL,
             ORDERED_QTY                    DECIMAL(5,0) NOT NULL,
             RCVD_QTY                       DECIMAL(5,0) NOT NULL,
             TTL_PUR_PRICE                  DECIMAL(10,4) NOT NULL,
             PUR_PRICE                      DECIMAL(15,4) NOT NULL,
             TTL_SELL_PRICE                 DECIMAL(10,4) NOT NULL,
             SELL_PRICE                     DECIMAL(15,4) NOT NULL,
             U_O_M                          CHAR(5) NOT NULL,
             CURRENCY                       CHAR(2) NOT NULL,
             PART_STS                       CHAR(1) NOT NULL,
             GROUP_CD                       CHAR(1) NOT NULL,
             BUYER                          CHAR(1) NOT NULL,
             CONT_SPOT                      CHAR(1) NOT NULL,
             JAP_LOC                        CHAR(1) NOT NULL,
             CARD_NUM                       CHAR(1) NOT NULL,
             HEAD_CD                        CHAR(2) NOT NULL,
             SHIP_CD                        CHAR(2) NOT NULL,
             TEMP_ITEM                      CHAR(1) NOT NULL,
             PRO_DATE                       CHAR(8) NOT NULL,
             HEAD_OFFICE_CD                 CHAR(2) NOT NULL,
             REPORTED_ON_APL                CHAR(8) NOT NULL,
             REJECT_IND                     CHAR(2) NOT NULL,
             ORDER_COMPANY                  CHAR(2) NOT NULL,
             RECEIVE_COMPANY                CHAR(2) NOT NULL,
             SUPPLIER_REF                   CHAR(25) NOT NULL,
             FINAL_DEST                     CHAR(2) NOT NULL,
             VAT_APPLICABLE                 CHAR(1) NOT NULL,
             TOC_TYPE                       CHAR(1) NOT NULL,
             MANUAL_INPUT_ID                CHAR(6) NOT NULL,
             INIT_TTL_SELL_PRIC             DECIMAL(10,4) NOT NULL,
             INIT_SELL_PRIC                 DECIMAL(15,4) NOT NULL,
             INIT_RCVD_QTY                  DECIMAL(5,0) NOT NULL,
             INIT_INV_NUM                   CHAR(10) NOT NULL,
             INIT_INV_DATE                  CHAR(8) NOT NULL,
             INIT_PART_CURCY                CHAR(2) NOT NULL,
             INIT_UPDATE                    CHAR(1) NOT NULL,
             PREV_TTL_ADJ_PRIC              DECIMAL(10,4) NOT NULL,
             PREV_ADJUST_QTY                DECIMAL(5,0) NOT NULL,
             PREV_ADJUST_CURCY              CHAR(2) NOT NULL
           ) ;
 /*********************************************************************/
 /* PLI DECLARATION FOR TABLE PROD.PURTDELI                           */
 /*********************************************************************/
 DCL 1 PURTDELI,
      5 MANIFEST CHAR(12),
      5 PART_NUM CHAR(12),
      5 SUPL_CD  CHAR(4),
      5 PLNT_CD  CHAR(1),
      5 DOCK     CHAR(2),
      5 PUR_ITEM CHAR(1),
      5 PART_CAT CHAR(1),
      5 RCVD_DATE  CHAR(8),
      5 INVOICE_NUM  CHAR(10),
      5 ORDERED_QTY  DEC FIXED(5,0),
      5 RCVD_QTY DEC FIXED(5,0),
      5 TTL_PUR_PRICE  DEC FIXED(10,4),
      5 PUR_PRICE  DEC FIXED(15,4),
      5 TTL_SELL_PRICE  DEC FIXED(10,4),
      5 SELL_PRICE  DEC FIXED(15,4),
      5 U_O_M    CHAR(5),
      5 CURRENCY CHAR(2),
      5 PART_STS CHAR(1),
      5 GROUP_CD CHAR(1),
      5 BUYER    CHAR(1),
      5 CONT_SPOT  CHAR(1),
      5 JAP_LOC  CHAR(1),
      5 CARD_NUM CHAR(1),
      5 HEAD_CD  CHAR(2),
      5 SHIP_CD  CHAR(2),
      5 TEMP_ITEM  CHAR(1),
      5 PRO_DATE CHAR(8),
      5 HEAD_OFFICE_CD  CHAR(2),
      5 REPORTED_ON_APL  CHAR(8),
      5 REJECT_IND  CHAR(2),
      5 ORDER_COMPANY  CHAR(2),
      5 RECEIVE_COMPANY  CHAR(2),
      5 SUPPLIER_REF  CHAR(25),
      5 FINAL_DEST  CHAR(2),
      5 VAT_APPLICABLE  CHAR(1),
      5 TOC_TYPE CHAR(1),
      5 MANUAL_INPUT_ID  CHAR(6),
      5 INIT_TTL_SELL_PRIC  DEC FIXED(10,4),
      5 INIT_SELL_PRIC  DEC FIXED(15,4),
      5 INIT_RCVD_QTY  DEC FIXED(5,0),
      5 INIT_INV_NUM  CHAR(10),
      5 INIT_INV_DATE  CHAR(8),
      5 INIT_PART_CURCY  CHAR(2),
      5 INIT_UPDATE  CHAR(1),
      5 PREV_TTL_ADJ_PRIC  DEC FIXED(10,4),
      5 PREV_ADJUST_QTY  DEC FIXED(5,0),
      5 PREV_ADJUST_CURCY  CHAR(2);
 /*********************************************************************/
 /* THE NUMBER OF COLUMNS DESCRIBED BY THIS DECLARATION IS 47         */
 /*********************************************************************/

